/**
 *                             _ooOoo_
 *                            o8888888o
 *                            88" . "88
 *                            (| -_- |)
 *                            O\  =  /O
 *                         ____/`---'\____
 *                       .'  \\|     |//  `.
 *                      /  \\|||  :  |||//  \
 *                     /  _||||| -:- |||||-  \
 *                     |   | \\\  -  /// |   |
 *                     | \_|  ''\---/''  |   |
 *                     \  .-\__  `-`  ___/-. /
 *                   ___`. .'  /--.--\  `. . __
 *                ."" '<  `.___\_<|>_/___.'  >'"".
 *               | | :  `- \`.;`\ _ /`;.`/ - ` : | |
 *               \  \ `-.   \_ __\ /__ _/   .-` /  /
 *          ======`-.____`-.___\_____/___.-`____.-'======
 *                             `=---='
 *          ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
 *                     佛祖保佑        永无BUG
 *            佛曰:
 *                   写字楼里写字间，写字间里程序员；
 *                   程序人员写程序，又拿程序换酒钱。
 *                   酒醒只在网上坐，酒醉还来网下眠；
 *                   酒醉酒醒日复日，网上网下年复年。
 *                   但愿老死电脑间，不愿鞠躬老板前；
 *                   奔驰宝马贵者趣，公交自行程序员。
 *                   别人笑我忒疯癫，我笑自己命太贱；
 *                   不见满街漂亮妹，哪个归得程序员？
*/
/*----------------------------------------------------------------
** Copyright (C) 2017 
**
** file：CodeEnum
** desc：
** 
** auth：KasimYe (KASIM)
** date：2018-01-06 12:03:00
**
** Ver.：V1.0.0
**----------------------------------------------------------------*/

using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Kasim.Framework.Entity.QuartzLog
{
    public enum ReturnEnum
    {
        业务执行成功=1,
        访问未授权_请得到授权后访问=2,
        机构名或密码错误_请使用正确的机构名或密码重试=3,
        令牌无效_请重新获取令牌=4,
        服务不可用=5,
        网络故障=6,
        业务执行失败=7,
        参数格式不正确=8,
        令牌有效期超过5分钟_不能再次获取令牌=9,
        访问过于频繁_请稍后再试=10
    }
    public enum ErrorEnum
    {
        参数不能为空=1,
        参数字典不正确=2,
        参数格式不正确=3,
        数据不存在=4,
        数据状态不符=5,
        数据重复提交=6,
        配送数量异常=7,
        批号_发票号重复=8
    }
}
